Model: "model_34"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 input_30 (InputLayer)       [(None, 72, 1)]              0         []                            
                                                                                                  
 model_32 (Functional)       (None, 128)                  99328     ['input_30[0][0]']            
                                                                                                  
 model_33 (Functional)       (None, 128)                  66560     ['input_30[0][0]']            
                                                                                                  
 concatenate_1 (Concatenate  (None, 256)                  0         ['model_32[0][0]',            
 )                                                                   'model_33[0][0]']            
                                                                                                  
 dense_69 (Dense)            (None, 128)                  32896     ['concatenate_1[0][0]']       
                                                                                                  
 dropout_79 (Dropout)        (None, 128)                  0         ['dense_69[0][0]']            
                                                                                                  
 dense_70 (Dense)            (None, 72)                   9288      ['dropout_79[0][0]']          
                                                                                                  
==================================================================================================
Total params: 208072 (812.78 KB)
Trainable params: 207944 (812.28 KB)
Non-trainable params: 128 (512.00 Byte)
__________________________________________________________________________________________________
